[
  {
    "heading": "Unit 1 – Electrostatics",
    "point1": "Electric charges and their conservation. Coulomb’s law-force between two point charges, forces between multiple charges; superposition principle and continuous charge distribution.",
    "point2": "Electric field, electric field due to a point charge, electric field lines; electric dipole, electric field due to a dipole; torque on a dipole in a uniform electric field.",
    "point3": "Electric potential, potential difference, electric potential due to a point charge, a dipole and system of charges: equipotential surfaces, electrical potential energy of a system of two point charges and of electric dipoles in an electrostatic field."
  },
  {
    "heading": "Unit 2 – Current Electricity",
    "point1": "Electric current, flow of electric charges in a metallic conductor, drift velocity and mobility, and their relation with electric current; Ohm’s law, electrical resistance, V-I characteristics (linear and nonlinear), electrical energy and power, electrical resistivity and conductivity.",
    "point2": "Carbon resistors, colour code for carbon resistors; series and parallel combinations of resistors; temperature dependence of resistance.Internal resistance of a cell, potential difference and emf of a cell, combination of cells in series and in parallel.",
    "point3": "Kirchoff’s laws and simple applications. Wheatstone bridge, metre bridge.Potentiometer-principle and applications to measure potential difference and for comparing emf of two cells; measurement of internal resistance of a cell."
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  },
  {
    "heading": "",
    "point1": "",
    "point2": "",
    "point3": ""
  }
]
